 pwd
/home/runner/Test3Session2
 gcc -g p3final.c
 ./a.out
enter n  value 
5
enter r valur
4
the ncr value is 5 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x879: file p3final.c, line 30.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:30
30  {
(gdb) n
32      input(&n,&r);
(gdb) n
enter n  value 
6
enter r valur
7
33      x=ncr(n,r); 
(gdb) n
34      output(n,r,x);
(gdb) n
35      return 0;
(gdb) l
30  {
31      int n,r,x;
32      input(&n,&r);
33      x=ncr(n,r); 
34      output(n,r,x);
35      return 0;
36
37  }(gdb) s
37  }(gdb) p
The history is empty.
(gdb) c
Continuing.
the ncr value is 0[Inferior 1 (process 1696) exited normally]
(gdb) l
32      input(&n,&r);
33      x=ncr(n,r); 
34      output(n,r,x);
35      return 0;
36
37  }(gdb) 
